## Data loading

In [32]:
import pandas as pd
import numpy as np
import psycopg2
from dotenv import load_dotenv
import os

if not load_dotenv(".env"):
    print("Warning: .env file not found. Make sure environment variables are set.")

In [33]:
pg_config = {
    'host': os.getenv('PGHOST'),
    'port': os.getenv('PGPORT'),
    'database': os.getenv('PGDATABASE'),
    'user': os.getenv('PGUSER'),
    'password': os.getenv('PGPASSWORD')
}

# test connection
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    cur.execute("""
    SELECT table_name
    FROM information_schema.tables
    WHERE table_schema = 'public'
    """)
    tables = cur.fetchall()
    print("Tables in the database:")
    for table in tables:
        print(table[0])
conn.close()

Tables in the database:
suppliers
products
customers
orders
order_items
shipments

### Suppliers

In [35]:
path = "../data/generated_data/"
fname ="suppliers.csv"
data = pd.read_csv(path + fname)
data.head()

,supplier_id,name,contact_info,country
0,1,Sphinx Worldbiz,sphinxworldbiz@company.com,Italy
1,2,Continental Automotive C...,continentalautomotivec@company.com,Sweden
2,3,Aryan Imaging & Business...,aryanimagingbusiness@company.com,Netherlands
3,4,J G Hosiery,jghosiery@company.com,Finland
4,5,Mukesh & Associates,mukeshassociates@company.com,Canada

In [5]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO suppliers (supplier_id, name, contact_info, country)
        VALUES (%s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [6]:
conn.close()

### Customers

In [36]:
fname = "customers.csv"
data = pd.read_csv(path + fname)
data.head()

   customer_id           name  location                     email
0            1     John Smith  New York     john.smith1@gmail.com
1            2  Emily Johnson    London  emily.johnson2@gmail.com
2            3  Michael Brown    Sydney  michael.brown3@gmail.com
3            4    Sarah Davis    Berlin    sarah.davis4@gmail.com
4            5   David Wilson   Toronto   david.wilson5@gmail.com

In [8]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO Customers (customer_id, name, location, email)
        VALUES (%s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [9]:
conn.close()

### Products

In [37]:
fname = "products.csv"
data = pd.read_csv(path + fname)
data.head()

,product_id,name,category,price,supplier_id,stock_quantity
0,1,ANTONIO BANDERAS1 - Fragrance-Women,Fragrance-Women,2.72,30,2446
1,2,BIBA24 - Indianwear-Women,Indianwear-Women,15.03,83,2008
2,3,BIBA140 - Indianwear-Women,Indianwear-Women,30.51,75,1462
3,4,AND117 - Westernwear-Women,Westernwear-Women,27.02,6,1505
4,5,CLOVIA64 - Lingerie&Nightwear-Women,Lingerie&Nightwear-Women,5.22,56,6283

In [11]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO Products (product_id, name, category, price, supplier_id, stock_quantity)
        VALUES (%s, %s, %s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [12]:
conn.close()

### Orders

In [38]:
fname = "orders.csv"
data = pd.read_csv(path + fname)
data.head()

   order_id  customer_id  order_date     status
0         1           41  2025-02-15  Delivered
1         2           29  2023-06-06    Shipped
2         3           12  2025-04-02    Shipped
3         4           23  2024-02-04    Pending
4         5           32  2023-02-17    Pending

In [15]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO Orders (order_id, customer_id, order_date, order_status)
        VALUES (%s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [16]:
conn.close()

### Order_items

In [39]:
fname = "order_items.csv"
data = pd.read_csv(path + fname)
data.head()

   order_items_id  order_id  product_id  quantity  price_at_purchase
0               1        33          20         2              17.54
1               2        15          56         1              16.88
2               3        52          34         3               9.91
3               4        74          37         2              19.61
4               5        73          39         2              32.25

In [19]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO Order_Items (order_item_id, order_id, product_id, quantity, price_at_purchase)
        VALUES (%s, %s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [20]:
conn.close()

### Shipments

In [40]:
fname = "shipments.csv"
data = pd.read_csv(path + fname)
data.head()

   shipment_id  order_id shipped_date delivery_date  shipping_cost
0            1         1   2025-02-17    2025-03-02          11.16
1            2         2   2023-06-11    2023-06-25           5.16
2            3         3   2025-04-07    2025-04-17           7.84
3            4         4   2024-02-11    2024-02-13          12.05
4            5         5   2023-02-24    2023-02-28           7.17

In [25]:
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for i, row in data.iterrows():
        sql = """
        INSERT INTO shipments (shipment_id, order_id, shipped_date, delivery_date, shipping_cost)
        VALUES (%s, %s, %s, %s, %s)
        """
        cur.execute(sql, tuple(row))
    conn.commit()

In [26]:
conn.close()

### Check everything is in the database

In [27]:
tables = ['suppliers', 'customers', 'products', 'orders', 'order_items', 'shipments']
conn = psycopg2.connect(**pg_config)
with conn.cursor() as cur:
    for table in tables:
        cur.execute(f"SELECT COUNT(*) FROM {table}")
        count = cur.fetchone()[0]
        print(f"Table {table} has {count} records.")
conn.close()

Table suppliers has 100 records.
Table customers has 100 records.
Table products has 100 records.
Table orders has 100 records.
Table order_items has 300 records.
Table shipments has 100 records.